{
  "name": "Erik T. Stidham",
  "info": {
     "label": "Software Engineer",
     "brief": "Self-starting team player looking to add value and excited to learn new technologies and solve difficult problems."
  },
  "contact": {
     "email": "estidham@gmail.com",
     "phone": "314-266-8367"
  },
  "location": {
    "city": "Saint Louis",
    "region": "MO",
    "country": "US",
    "code": "63129",
    "address": "5703 Briarwood Estates Dr"
  },
  "employment": {
    "history": [
      {
        "position": "Senior Software Engineer",
        "employer": "Dell EMC / Virtustream",
        "summary": "Worked with high performance distributed DevOps team.",
        "start": "2016-01",
        "end": "2016-11",
        "url": "http://virtustream.com/",
        "keywords": [],
        "highlights": [
          "Intercepted disruptions to team members by being the first responder to issues on our microservice platform running Mesos and Marathon that consisted of eight production sites, each with 20+ nodes.",
          "Ensured production and lab services were functioning and healthy by recovering crashed or stuck nodes and restoring services when on-call and when available.",
          "Contributed to configuration management (SaltStack) and reviewed coworkers' contributions to ensure we were maintaining our standards and following best practices.",
          "Added features to the test and development platform, by updating Ansible playbooks.",
          "Prepared for platform upgrades by porting custom code changes to newer software versions and verifying functionality in the new versions. Also tested new functionality available, specifically Mesos CNI with Calico networking.",
          "Created Python utilities for production, build, and test environments.",
          "Administered TeamCity ensuring CICD and automated testing was running smoothly, also added integration plugins when needed.",
          "Launched and documented Pivotal Cloud Foundry (PCF) on OpenStack as a proof of concept. Also created a data bridge to report metrics from PCF and setup monitoring dashboards.",
          "Migrated internal Docker registry to version 2 and enabled the upgrade by updating systems running older versions of docker."
        ]
      },
      {
        "position": "Senior Engineer",
        "employer": "VelociData Inc.",
        "summary": "Developed high throughput processing appliance as part of an agile team.",
        "start": "2013-01",
        "end": "2015-12",
        "url": "http://velocidata.com",
        "keywords": [],
        "highlights": [
          "Added features to the appliance by designing and developing new functionality.",
          "Maintained coding standards by reviewing team members script and code contributions.",
          "Ensured confidence in testing and release process by bringing up Jenkins CI testing to be an integral part of the development/release process.",
          "Designed and implemented upgrade system for distribution of package updates to CentOS 6 based appliance.",
          "Improved quality and stability by contributing to unit and integration testing.",
          "Enabled performance and integration testing through script and support utility creation.",
          "Successfully utilized the Agile Scrum process after transitioning with team from no official process.",
          "Supported customer installations as part of the on-call rotation.  This included performing in-depth analysis and resolution of the issue or creating tickets to address the issue by the larger team.",
          "Enabled switch to newer FPGA interface by developing application and support code and making minor updates to our kernel module."
        ]
      },
      {
        "position": "Senior Engineering Specialist",
        "employer": "DRS Sustainment System, Inc.",
        "summary": "Maintained and developed software for military radar systems.",
        "start": "2004-06",
        "end": "2013-01",
        "url": "http://www.drs.com/",
        "keywords": [],
        "highlights": [
          "Kept development moving on an aggressively scheduled radar program by taking over as lead when the previous lead left.",
          "Often worked with Systems Engineering on creating and updating requirements and implementing newly developed processing algorithms.",
          "Developed applications interfacing to FPGAs over PCI Express, and supported debugging of FPGA functionality.",
          "Supported customer both on-site and off-site.",
          "Ensured quality of other projects by performing design reviews.",
          "Created a comprehensive estimate for emulating an aging radar system",
          "Led a small team to port legacy code to a new platform and environment.",
          "Profiled algorithms to identify bottleneck areas and optimized application to meet performance requirements.",
          "Researched operating systems with real-time capabilities and made recommendations for a new platform.",
          "Modernized source control system by switching to Subversion.",
          "Developed an application which provided an XML interface to control a Surveillance Radar. Utilized/Integrated pre-existing code base for radar control."
        ]
      }
    ]
  },
  "education": {
    "level": "Bachelor",
    "history": [
      {
        "institution": "University of Missouri-Rolla",
        "start": "1999-08",
        "end": "2004-05",
        "grade": "3.65/4.0",
        "summary": "",
        "area": "Computer Science and Computer Engineering",
        "studyType": "Bachelor"
      }
    ]
  },
  "skills": {
    "sets": [
      {
        "name": "Languages",
        "skills": [
          "Python",
          "C++",
          "Bash",
          "Go"
        ]
      },
      {
        "name": "Operating Systems",
        "skills": [
          "Ubuntu",
          "CentOS 6",
          "VxWorks"
        ]
      },
      {
        "name": "Configuration Management",
        "skills": [
          "SaltStack",
          "Ansible"
        ]
      },
      {
        "name": "Containerization",
        "skills": [
          "Docker",
          "Mesos",
          "Marathon"
        ]
      },
      {
        "name": "Tools",
        "skills": [
          "TeamCity",
          "Artifactory",
          "Docker Registry",
          "Jira",
          "Jenkins CI",
          "RPM/Yum"
        ]
      },
      {
        "name": "Dev Tools",
        "skills": [
          "Git",
          "Vim",
          "Vagrant",
          "Make/Makefiles",
          "GDB",
          "Subversion",
          "Valgrind",
          "Eclipse IDE"
        ]
      },
      {
        "name": "Experience with",
        "skills": [
          "JSON/Yaml",
          "GoogleTest/Mock",
          "PostgreSQL",
          "Linux Kernel modules",
          "strace",
          "XML/XSD",
          "SNMP",
          "EBCDIC"
        ]
      }
    ]
  },
  "social": [
    {
      "label": "GitHub",
      "network": "GitHub",
      "url": "https://github.com/tmjd",
      "user": "tmjd"
    },
    {
      "label": "LinkedIn",
      "network": "LinkedIn",
      "url": "http://www.linkedin.com/in/erik-stidham",
      "user": "erik-stidham"
    }
  ],
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  }
}
