{
  "basics": {
    "name": "Erik T. Stidham",
    "label": "Software/DevOps Engineer",
    "summary": "Obtain a challenging software engineering position at a company with software as one of the core foundations of its business.",
    "phone": "1-314-266-8367",
    "email": "estidham@gmail.com",
    "location": {
      "address": "5703 Briarwood Estates Dr",
      "postalCode": "63129",
      "city": "Saint Louis",
      "countryCode": "US",
      "region": "MO"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "tmjd",
        "url": "https://github.com/tmjd"
      },
      {
        "network": "LinkedIn",
        "username": "erik-stidham",
        "url": "http://www.linkedin.com/in/erik-stidham"
      }
    ]
  },
  "work": [
    {
      "company": "Dell EMC / Virtustream",
      "website": "http://virtustream.com/",
      "position": "Senior Software Engineer",
      "startDate": "2016-01",
      "endDate": "2016-11",
      "summary": "Worked with high performance distributed DevOps team.",
      "highlights": [
        "Contributed to the maintenance of a microservice platform that consisted of eight production sites, each with 20+ nodes, that run custom branches of Mesos, Consul, etcd, and Calico.",
        "Ensured production and lab services were functioning and healthy by recovering crashed or stuck nodes and restoring services when on-call and other times when available.",
        "Contributed to configuration management (SaltStack) and reviewed coworkers' contributions to ensure we were maintaining our standards and following best practices.",
        "Prepared for platform upgrades by porting custom code changes to newer software versions and verifying functionality in the new versions. Also tested new functionality available, specifically Mesos CNI with Calico networking.",
        "Built version resolver tooling used to create a 'platform version' manifest, the manifest is used to control versions and ensure consistent testing of the platform as a whole.",
        "Administered TeamCity ensuring CICD and automated testing was running smoothly, also added integration plugins when needed.",
        "Launched and documented Pivotal Cloud Foundry (PCF) on OpenStack as a proof of concept. Also created a data bridge to report metrics from PCF and setup monitoring dashboards.",
        "Migrated internal Docker registry to version 2 and enabled the upgrade by updating systems running older versions of docker."
      ]
    },
    {
      "company": "VelociData Inc.",
      "website": "http://velocidata.com",
      "position": "Senior Engineer",
      "startDate": "2013-01",
      "endDate": "2015-12",
      "summary": "Developed high throughput processing appliance as part of an agile team.",
      "highlights": [
        "Contributed to software design, development, and reviews to add features and functionality to the appliance.",
        "Improved quality and stability with unit and integration testing.",
        "Enabled performance and integration testing through script and support utility creation.",
        "Supported customer installations as part of the on-call rotation.  This included performing in-depth analysis and resolution of the issue or creating tickets to address the issues by the larger team.",
        "Successfully utilized the Agile Scrum process after transitioning with team from no official process.",
        "Enabled switch to newer FPGA interface by developing application and support code and making minor updates to our kernel module.",
        "Ensured confidence in testing and release process by bringing up Jenkins CI testing to be an integral part of the development/release process.",
        "Designed and implemented upgrade system for distribution of package updates to CentOS 6 based appliance."
      ]
    },
    {
      "company": "DRS Sustainment System, Inc.",
      "website": "http://www.drs.com/",
      "position": "Senior Engineering Specialist",
      "startDate": "2004-06",
      "endDate": "2013-01",
      "summary": "Maintained and developed military radar systems.",
      "highlights": [
        "Filled lead role when needed on an aggressively scheduled radar program.  Worked with Systems Engineering to complete requirements, developed interface to FPGAs over PCI Express, and supported debugging of FPGAs.",
        "Supported customer both on-site and off-site.",
        "Ensured quality of other projects by performing design reviews.",
        "Created a comprehensive estimate for emulating an aging radar system",
        "Worked on a redesign of a Ground Based Surveillance Radar control application. Made recommendations on operating system selection with real time capabilities. Profiled algorithms on new platform to identify bottleneck areas. Led a small team to port legacy code to the new environment. Worked with Systems Engineering to implement new processing algorithms and optimized the software to satisfy performance requirements utilizing signal processing library.",
        "Modernized source control system by switching to Subversion.",
        "Developed an application which provided an XML interface to control a Surveillance Radar. Utilized/Integrated pre-existing code base for radar control. Created/Updated requirements and test documents as needed."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Missouri-Rolla",
      "area": "Computer Science and Computer Engineering",
      "studyType": "Bachelor",
      "gpa": "3.65/4.0",
      "startDate": "1999-08",
      "endDate": "2004-05"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "keywords": [
        "Python",
        "C++",
        "Bash",
        "Go"
      ]
    },
    {
      "name": "Operating Systems",
      "keywords": [
        "Ubuntu",
        "CentOS 6",
        "VxWorks"
      ]
    },
    {
      "name": "Configuration Management",
      "keywords": [
        "SaltStack",
        "Ansible"
      ]
    },
    {
      "name": "Containerization",
      "keywords": [
        "Docker",
        "Mesos",
        "Marathon"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "TeamCity",
        "Artifactory",
        "Docker Registry",
        "Jira",
        "Jenkins CI",
        "RPM/Yum"
      ]
    },
    {
      "name": "Dev Tools",
      "keywords": [
        "Git",
        "Vim",
        "Make/Makefiles",
        "GDB",
        "Subversion",
        "Valgrind",
        "Eclipse IDE"
      ]
    },
    {
      "name": "Experience with",
      "keywords": [
          "JSON/Yaml",
          "GoogleTest/Mock",
          "PostgreSQL",
          "Linux Kernel modules",
          "strace",
          "XML/XSD",
          "SNMP",
          "EBCDIC"
      ]
    }
  ]
}
